### Read the three files into python as dataframes

In [1]:
import pandas as pd

df1 = pd.read_csv("csv_files/file1.csv")
df1.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

In [2]:
df2 = pd.read_csv("csv_files/file2.csv")
df2.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car

In [3]:
df3 = pd.read_csv("csv_files/file3.csv")
df3.head(3)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car

### Show the DataFrame's shape

In [4]:
print("df1", df1.shape)
print("df2", df2.shape)
print("df3", df3.shape)

df1 (4008, 11)
df2 (996, 11)
df3 (7070, 11)

### Standardize header names

In [5]:
df1.columns = ['Customer','State','Gender','Education','Customer Lifetime Value','Income','Monthly Premium Auto',
               'Number of Open Complaints','Policy Type','Vehicle Class','Total Claim Amount']

In [6]:
df2.columns = ['Customer','State','Gender','Education','Customer Lifetime Value','Income','Monthly Premium Auto',
               'Number of Open Complaints','Total Claim Amount','Policy Type','Vehicle Class']

In [7]:
df2 = df2[['Customer','State','Gender','Education','Customer Lifetime Value','Income','Monthly Premium Auto',
           'Number of Open Complaints','Policy Type','Vehicle Class','Total Claim Amount']]

In [8]:
df3 = df3[['Customer','State','Gender','Education', 'Customer Lifetime Value','Income','Monthly Premium Auto',
           'Number of Open Complaints','Policy Type','Vehicle Class','Total Claim Amount']]

In [9]:
(df1.columns == df2.columns) & (df1.columns == df3.columns)

array([ True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True])

In [10]:
df2.head(1)

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,Personal Auto,Four-Door Car,633.6

In [11]:
df1.head(1)

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [12]:
df3.head(1)

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,SA25987,Washington,M,High School or Below,3479.137523,0,104,0,Personal Auto,Two-Door Car,499.2

### Concatenate the three dataframes

In [13]:
data = pd.concat([df1,df2,df3], axis=0)
data.shape

(12074, 11)

### Which columns are numerical?

In [14]:
data.select_dtypes(['int64','float64'])

       Income  Monthly Premium Auto  Total Claim Amount
0         0.0                1000.0            2.704934
1         0.0                  94.0         1131.464935
2     48767.0                 108.0          566.472247
3         0.0                 106.0          529.881344
4     36357.0                  68.0           17.269323
...       ...                   ...                 ...
7065  71941.0                  73.0          198.234764
7066  21604.0                  79.0          379.200000
7067      0.0                  85.0          790.784983
7068  21941.0                  96.0          691.200000
7069      0.0                  77.0          369.600000

[12074 rows x 3 columns]

### Which columns are categorical?

In [15]:
data.select_dtypes('object')

,Customer,State,Gender,Education,Customer Lifetime Value,Number of Open Complaints,Policy Type,Vehicle Class
0,RB50392,Washington,NaN,Master,NaN,1/0/00,Personal Auto,Four-Door Car
1,QZ44356,Arizona,F,Bachelor,697953.59%,1/0/00,Personal Auto,Four-Door Car
2,AI49188,Nevada,F,Bachelor,1288743.17%,1/0/00,Personal Auto,Two-Door Car
3,WW63253,California,M,Bachelor,764586.18%,1/0/00,Corporate Auto,SUV
4,GA49547,Washington,M,High School or Below,536307.65%,1/0/00,Personal Auto,Four-Door Car
...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23406,0,Personal Auto,Four-Door Car
7066,PK87824,California,F,College,3096.51,0,Corporate Auto,Four-Door Car
7067,TD14365,California,M,Bachelor,8163.89,3,Corporate Auto,Four-Door Car
7068,UP19263,California,M,College,7524.44,0,Personal Auto,Four-Door Car
7069,Y167826,California,M,College,2611.84,0,Corporate Auto,Two-Door Car

### Understand the meaning of all columns

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   9137 non-null   object
 1   State                      9137 non-null   object
 2   Gender                     9015 non-null   object
 3   Education                  9137 non-null   object
 4   Customer Lifetime Value    9130 non-null   object
 5   Income                     9137 non-null   float64
 6   Monthly Premium Auto       9137 non-null   float64
 7   Number of Open Complaints  9137 non-null   object
 8   Policy Type                9137 non-null   object
 9   Vehicle Class              9137 non-null   object
 10  Total Claim Amount         9137 non-null   float64
dtypes: float64(3), object(8)
memory usage: 1.1+ MB

## Perform the data cleaning operations mentioned so far in class   
### Delete the column education and the number of open complaints from the dataframe.

In [17]:
data.drop(["Education","Number of Open Complaints"], axis = 1, inplace = True)

In [18]:
data.head(2)

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0.0,94.0,Personal Auto,Four-Door Car,1131.464935

### Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [19]:
data['Customer Lifetime Value'] = pd.to_numeric(data['Customer Lifetime Value'], errors = 'coerce')
data['Customer Lifetime Value'].dtypes

dtype('float64')

In [20]:
#mean = data['Customer Lifetime Value'].mean()
#data['Customer Lifetime Value'].fillna(mean)
#data['Customer Lifetime Value'] = data['Customer Lifetime Value'].fillna(mean)

In [21]:
data['Customer Lifetime Value'] = data['Customer Lifetime Value'].astype(float)
data['Customer Lifetime Value'].dtypes

dtype('float64')

In [22]:
data['Customer Lifetime Value'] = data['Customer Lifetime Value'] * 100

In [23]:
data.columns[data.isnull().any()]

Index(['Customer', 'State', 'Gender', 'Customer Lifetime Value', 'Income',
       'Monthly Premium Auto', 'Policy Type', 'Vehicle Class',
       'Total Claim Amount'],
      dtype='object')

### Check for duplicate rows in the data and remove if any

In [24]:
sum(data.duplicated())

2939

In [25]:
data.shape

(12074, 9)

In [26]:
data.drop_duplicates(inplace = True)

In [27]:
sum(data.duplicated())

0

In [29]:
data.shape

(9135, 9)

### Filter out the data for customers who have an income of 0 or less

In [30]:
 data[data["Income"] <= 0]

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,NaN,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,NaN,0.0,106.0,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,NaN,0.0,101.0,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,NaN,0.0,67.0,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,F,5.678050e+05,0.0,76.0,Personal Auto,Four-Door Car,364.800000
7061,RX91025,California,M,1.987226e+06,0.0,185.0,Personal Auto,SUV,1950.725547
7062,AC13887,California,M,4.628995e+05,0.0,67.0,Corporate Auto,Two-Door Car,482.400000
7067,TD14365,California,M,8.163890e+05,0.0,85.0,Corporate Auto,Four-Door Car,790.784983
7069,Y167826,California,M,2.611837e+05,0.0,77.0,Corporate Auto,Two-Door Car,369.600000

In [31]:
data.to_csv('lab-round-1.csv', index = False)